pascallanger/DIY-Multiprotocol-TX-Module/BootLoaders/Boards/avr/variants/xmega32d4/pins_arduino.h
// default 2-wire on PC0,PC1 - TWIC
#ifdef USE_TWIC
static const uint8_t SDA = 20;
static const uint8_t SCL = 21;
#else // !USE_TWIC
static const uint8_t SDA = 6;
static const uint8_t SCL = 7;
#endif // USE_TWIC

// port-specific 2-wire
#ifdef USE_TWIC
static const uint8_t SDA0 = 20;
static const uint8_t SCL0 = 21;
#else // !USE_TWIC
static const uint8_t SDA0 = 6;
static const uint8_t SCL0 = 7;
#endif // USE_TWIC
static const uint8_t SDA1 = 14;
static const uint8_t SCL1 = 15;


// keep track of the indices for port R since its control register
// settings should be slightly different - D manual table 11-6
#define PR0 18
#define PR1 19

#else // no digital I/O pin shifting, PORTD pin 0 is digital I/O pin 0 (as it should be)

// default "no shift" pin assignments

// default SPI
static const uint8_t SS   = 12;
static const uint8_t MOSI = 13;
static const uint8_t MISO = 14;
static const uint8_t SCK  = 15;

// primary SPI on PC4-7
static const uint8_t SS0   = 12;
static const uint8_t MOSI0 = 13;
static const uint8_t MISO0 = 14;
static const uint8_t SCK0  = 15;

// secondary SPI on PD4-7
static const uint8_t SS1   = 4;
static const uint8_t MOSI1 = 5;
static const uint8_t MISO1 = 6;
static const uint8_t SCK1  = 7;

// default 2-wire on PC0,PC1 - TWIC (TWIE appears to be broken)
static const uint8_t SDA = 8;
static const uint8_t SCL = 9;
static const uint8_t SDA0 = 8;
static const uint8_t SCL0 = 9;
static const uint8_t SDA1 = 16;
static const uint8_t SCL1 = 17;

// keep track of the indices for port R since its control register
// settings should be slightly different - D manual table 11-6
#define PR0 20
#define PR1 21

#endif // DIGITAL_IO_PIN_SHIFT


// default 'status' LED on PR1
//static const uint8_t LED_BUILTIN = PR1;
#define LED_BUILTIN PR1 /* Arduino 1.06 uses #define, not a const uint8_t */

static const uint8_t A0 = 22;
static const uint8_t A1 = 23;
static const uint8_t A2 = 24;
static const uint8_t A3 = 25;
static const uint8_t A4 = 26;
static const uint8_t A5 = 27;
static const uint8_t A6 = 28;
static const uint8_t A7 = 29;
static const uint8_t A8 = 30;
static const uint8_t A9 = 31;
static const uint8_t A10 = 32;
static const uint8_t A11 = 33;

// on the xmega64d4, PA2, PB2, PC2, PD2, and PE2 are asynchronous ints.  Others are 'synchronous' which means
// that they must be held in their 'interrupt state' long enough for the system to detect them.  In any case
// all digital input pins can be use as interrupts, synchronous or otherwise.



#ifdef ARDUINO_MAIN


const uint16_t PROGMEM port_to_mode_PGM[] = {
  NOT_A_PORT,             // 0
  (uint16_t) &PORTA_DIR,       // PA
  (uint16_t) &PORTB_DIR,       // PB
  (uint16_t) &PORTC_DIR,       // PC
  (uint16_t) &PORTD_DIR,       // PD
  (uint16_t) &PORTE_DIR,       // PE
  (uint16_t) &PORTR_DIR,       // PR
};

const uint16_t PROGMEM port_to_output_PGM[] = {
  NOT_A_PORT,              // 0
  (uint16_t) &PORTA_OUT,       // PA
  (uint16_t) &PORTB_OUT,       // PB
  (uint16_t) &PORTC_OUT,       // PC
  (uint16_t) &PORTD_OUT,       // PD
  (uint16_t) &PORTE_OUT,       // PE
  (uint16_t) &PORTR_OUT,       // PR
};

const uint16_t PROGMEM port_to_input_PGM[] = {
  NOT_A_PORT,             // 0
  (uint16_t) &PORTA_IN,       // PA
  (uint16_t) &PORTB_IN,       // PB
  (uint16_t) &PORTC_IN,       // PC
  (uint16_t) &PORTD_IN,       // PD
  (uint16_t) &PORTE_IN,       // PE
  (uint16_t) &PORTR_IN,       // PR
};

const uint8_t PROGMEM port_to_int0_PGM[] = {
  NOT_AN_INTERRUPT,           // 0
  PORTA_INT0,                 // PA
  PORTB_INT0,                 // PB
  PORTC_INT0,                 // PC
  PORTD_INT0,                 // PD
  PORTE_INT0,                 // PE
  PORTR_INT0,                 // PR
};

// xmega has a per-pin config register as well.  Normally these will be 00000111 for analog, 00000000 for digital 'totem pole'
// for 'INPUT_PULLUP' these will be 00011111
//   bits 2:0 (trigger)  000 both edges  001 rising  010 falling  011 level  111 input buffer disabled
//            note:  'input buffer disabled' required to use the 'IN' register (so default here)
//                   also port R does not support 'INTPUT_DISABLED' (sic) so use BOTHEDGES [0] instead
//   bits 5:3 (out/pull) 000 TOTEM [normal], 001 bus keeper [sticky], 010 pulldown, 011 pullup,
//                       100 wired 'or', 101 wired 'and', 110 wired 'or' pulldown, 111 wired 'and' pullup
//   bit 6:  "invert logic" (0 = normal, 1 = inverted)
//   bit 7:  unused, must be zero
// NOTE:  PORTA through PORTE (PORTF?) support 'input buffer disabled' and this setting is recommended
//        for analog inputs.  PORTR apparently does NOT support this (set to zero?)

const uint16_t PROGMEM digital_pin_to_control_PGM[] = {
#ifndef DIGITAL_IO_PIN_SHIFT
  (uint16_t) &PORTD_PIN0CTRL,  // PD 0 ** 0 **
  (uint16_t) &PORTD_PIN1CTRL,  // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT
// subtract 2 from the digital pin number if DIGITAL_IO_PIN_SHIFT is defined
  (uint16_t) &PORTD_PIN2CTRL,  // PD 2 ** 2 ** USARTD_RX     ASYNC
  (uint16_t) &PORTD_PIN3CTRL,  // PD 3 ** 3 ** USARTD_TX
  (uint16_t) &PORTD_PIN4CTRL,  // PD 4 ** 4 **
  (uint16_t) &PORTD_PIN5CTRL,  // PD 5 ** 5 **
  (uint16_t) &PORTD_PIN6CTRL,  // PD 6 ** 6 **
  (uint16_t) &PORTD_PIN7CTRL,  // PD 7 ** 7 **
#if defined(DIGITAL_IO_PIN_SHIFT) && defined(USE_TWIC)
  (uint16_t) &PORTD_PIN0CTRL,  // PD 0 ** 8 ** map PORTD pins 0/1 here if TWIC is used
  (uint16_t) &PORTD_PIN1CTRL,  // PD 1 ** 9 **
#else
  (uint16_t) &PORTC_PIN0CTRL,  // PC 0 ** 8 ** SDA
  (uint16_t) &PORTC_PIN1CTRL,  // PC 1 ** 9 ** SCL
#endif // defined(DIGITAL_IO_PIN_SHIFT) && defined(USE_TWIC)
  (uint16_t) &PORTC_PIN2CTRL,  // PC 2 ** 10 **              ASYNC
  (uint16_t) &PORTC_PIN3CTRL,  // PC 3 ** 11 **
  (uint16_t) &PORTC_PIN4CTRL,  // PC 4 ** 12 ** SPI_SS
  (uint16_t) &PORTC_PIN5CTRL,  // PC 5 ** 13 ** SPI_MOSI
  (uint16_t) &PORTC_PIN6CTRL,  // PC 6 ** 14 ** SPI_MISO
  (uint16_t) &PORTC_PIN7CTRL,  // PC 7 ** 15 ** SPI_SCK
  (uint16_t) &PORTE_PIN0CTRL,  // PE 0 ** 16 ** SDA1
  (uint16_t) &PORTE_PIN1CTRL,  // PE 1 ** 17 ** SCL1
  (uint16_t) &PORTE_PIN2CTRL,  // PE 2 ** 18 **              ASYNC
  (uint16_t) &PORTE_PIN3CTRL,  // PE 3 ** 19 **
  (uint16_t) &PORTR_PIN0CTRL,  // PR 0 ** 20 **
  (uint16_t) &PORTR_PIN1CTRL,  // PR 1 ** 21 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
#ifdef USE_TWIC
  (uint16_t) &PORTC_PIN0CTRL,  // PC 0 ** the new 20 ** SDA, SDA0
  (uint16_t) &PORTC_PIN1CTRL,  // PC 1 ** the new 21 ** SCL, SCL0
#else
  (uint16_t) &PORTD_PIN0CTRL,  // PD 0 ** the new 20 **
  (uint16_t) &PORTD_PIN1CTRL,  // PD 1 ** the new 21 **
#endif // USE_TWIC
#endif // DIGITAL_IO_PIN_SHIFT
  (uint16_t) &PORTA_PIN0CTRL,  // PA 0 ** 22 ** A0
  (uint16_t) &PORTA_PIN1CTRL,  // PA 1 ** 23 ** A1
  (uint16_t) &PORTA_PIN2CTRL,  // PA 2 ** 24 ** A2           ASYNC
  (uint16_t) &PORTA_PIN3CTRL,  // PA 3 ** 25 ** A3
  (uint16_t) &PORTA_PIN4CTRL,  // PA 4 ** 26 ** A4
  (uint16_t) &PORTA_PIN5CTRL,  // PA 5 ** 27 ** A5
  (uint16_t) &PORTA_PIN6CTRL,  // PA 6 ** 28 ** A6
  (uint16_t) &PORTA_PIN7CTRL,  // PA 7 ** 29 ** A7
  (uint16_t) &PORTB_PIN0CTRL,  // PB 0 ** 30 ** A8
  (uint16_t) &PORTB_PIN1CTRL,  // PB 1 ** 31 ** A9
  (uint16_t) &PORTB_PIN2CTRL,  // PB 2 ** 32 ** A10         ASYNC
  (uint16_t) &PORTB_PIN3CTRL,  // PB 3 ** 33 ** A11
};

