pascallanger/DIY-Multiprotocol-TX-Module/BootLoaders/Boards/avr/variants/xmega32d4/pins_arduino.h
const uint8_t PROGMEM digital_pin_to_port_PGM[] = {
  // PORTLIST
  // -------------------------------------------
#ifndef DIGITAL_IO_PIN_SHIFT
  _PD,  // PD 0 ** 0 **
  _PD,  // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT
// subtract 2 from the digital pin number if DIGITAL_IO_PIN_SHIFT is defined
  _PD,  // PD 2 ** 2 ** USARTD_RX
  _PD,  // PD 3 ** 3 ** USARTD_TX
  _PD,  // PD 4 ** 4 **
  _PD,  // PD 5 ** 5 **
  _PD,  // PD 6 ** 6 **
  _PD,  // PD 7 ** 7 **
#if defined(DIGITAL_IO_PIN_SHIFT) && defined(USE_TWIC)
  _PD,  // PD 0 ** 8 **
  _PD,  // PD 1 ** 9 **
#else
  _PC,  // PC 0 ** 8 ** SDA
  _PC,  // PC 1 ** 9 ** SCL
#endif // defined(DIGITAL_IO_PIN_SHIFT) && defined(USE_TWIC)
  _PC,  // PC 2 ** 10 **
  _PC,  // PC 3 ** 11 **
  _PC,  // PC 4 ** 12 ** SPI_SS
  _PC,  // PC 5 ** 13 ** SPI_MOSI
  _PC,  // PC 6 ** 14 ** SPI_MISO
  _PC,  // PC 7 ** 15 ** SPI_SCK
  _PE,  // PE 0 ** 16 ** SDA
  _PE,  // PE 1 ** 17 ** SCL
  _PE,  // PE 2 ** 18 **
  _PE,  // PE 3 ** 19 **
  _PR,  // PR 0 ** 20 **
  _PR,  // PR 1 ** 21 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
#ifdef USE_TWIC
  _PC,  // PC 0 ** the new 20 ** SDA
  _PC,  // PC 1 ** the new 21 ** SCL
#else
  _PD,  // PD 0 ** the new 20 **
  _PD,  // PD 1 ** the new 21 **
#endif // USE_TWIC
#endif // DIGITAL_IO_PIN_SHIFT
  _PA,  // PA 0 ** 22 ** A0
  _PA,  // PA 1 ** 23 ** A1
  _PA,  // PA 2 ** 24 ** A2
  _PA,  // PA 3 ** 25 ** A3
  _PA,  // PA 4 ** 26 ** A4
  _PA,  // PA 5 ** 27 ** A5
  _PA,  // PA 6 ** 28 ** A6
  _PA,  // PA 7 ** 29 ** A7
  _PB,  // PB 0 ** 30 ** A8
  _PB,  // PB 1 ** 31 ** A9
  _PB,  // PB 2 ** 32 ** A10
  _PB,  // PB 3 ** 33 ** A11
};

const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] = {
  // PIN IN PORT
  // -------------------------------------------
#ifndef DIGITAL_IO_PIN_SHIFT
  _BV( 0 ),  // PD 0 ** 0 **
  _BV( 1 ),  // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT
// subtract 2 from the digital pin number if DIGITAL_IO_PIN_SHIFT is defined
  _BV( 2 ),  // PD 2 ** 2 ** USARTD_RX
  _BV( 3 ),  // PD 3 ** 3 ** USARTD_TX
  _BV( 4 ),  // PD 4 ** 4 **
  _BV( 5 ),  // PD 5 ** 5 **
  _BV( 6 ),  // PD 6 ** 6 **
  _BV( 7 ),  // PD 7 ** 7 **
#if defined(DIGITAL_IO_PIN_SHIFT) && defined(USE_TWIC)
  _BV( 0 ),  // PD 0 ** 8 **
  _BV( 1 ),  // PD 1 ** 9 **
#else
  _BV( 0 ),  // PC 0 ** 8 ** SDA
  _BV( 1 ),  // PC 1 ** 9 ** SCL
#endif // defined(DIGITAL_IO_PIN_SHIFT) && defined(USE_TWIC)
  _BV( 2 ),  // PC 2 ** 10 **
  _BV( 3 ),  // PC 3 ** 11 **
  _BV( 4 ),  // PC 4 ** 12 ** SPI_SS
  _BV( 5 ),  // PC 5 ** 13 ** SPI_MOSI
  _BV( 6 ),  // PC 6 ** 14 ** SPI_MISO
  _BV( 7 ),  // PC 7 ** 15 ** SPI_SCK
  _BV( 0 ),  // PE 0 ** 16 ** SDA
  _BV( 1 ),  // PE 1 ** 17 ** SCL
  _BV( 2 ),  // PE 2 ** 18 **
  _BV( 3 ),  // PE 3 ** 19 **
  _BV( 0 ),  // PR 0 ** 20 **
  _BV( 1 ),  // PR 1 ** 21 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
#ifdef USE_TWIC
  _BV( 0 ),  // PC 0 ** the new 20 ** SDA
  _BV( 1 ),  // PC 1 ** the new 21 ** SCL
#else
  _BV( 0 ),  // PD 0 ** the new 20 **
  _BV( 1 ),  // PD 1 ** the new 21 **
#endif // USE_TWIC
#endif // DIGITAL_IO_PIN_SHIFT
  _BV( 0 ),  // PA 0 ** 22 ** A0
  _BV( 1 ),  // PA 1 ** 23 ** A1
  _BV( 2 ),  // PA 2 ** 24 ** A2
  _BV( 3 ),  // PA 3 ** 25 ** A3
  _BV( 4 ),  // PA 4 ** 26 ** A4
  _BV( 5 ),  // PA 5 ** 27 ** A5
  _BV( 6 ),  // PA 6 ** 28 ** A6
  _BV( 7 ),  // PA 7 ** 29 ** A7
  _BV( 0 ),  // PB 0 ** 30 ** A8
  _BV( 1 ),  // PB 1 ** 31 ** A9
  _BV( 2 ),  // PB 2 ** 32 ** A10
  _BV( 3 ),  // PB 3 ** 33 ** A11
};

const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
  // TIMERS
  // -------------------------------------------
  // for now 'NOT_ON_TIMER' for all - later, assign timers based
  // on pins 0-3 being enabled as PWM out for ports A through E
  // corresponding to timers A through D (see D manual sections 11.12.14,
  // also see D manual sect 13.6 for using the 'compare' channel on 'TCx2' to generate
  // a PWM output.  Must select pin as output, _AND_ enable the 'compare' output
  // for the appropriate pin.  LCMPENx/HCMPENx registers to enable it.

#ifndef DIGITAL_IO_PIN_SHIFT
  TIMERD2,       // PD 0 ** 0 **
  TIMERD2,       // PD 1 ** 1 **
#endif // DIGITAL_IO_PIN_SHIFT
// subtract 2 from the digital pin number if DIGITAL_IO_PIN_SHIFT is defined
  TIMERD2,       // PD 2 ** 2 ** USARTD_RX
  TIMERD2,       // PD 3 ** 3 ** USARTD_TX
  TIMERD2,       // PD 4 ** 4 **
  TIMERD2,       // PD 5 ** 5 **
  TIMERD2,       // PD 6 ** 6 **
  TIMERD2,       // PD 7 ** 7 **
#if defined(DIGITAL_IO_PIN_SHIFT) && defined(USE_TWIC)
  TIMERD2,       // PD 0 ** 8 **
  TIMERD2,       // PD 1 ** 9 **
#else
  TIMERC2,       // PC 0 ** 8 ** SDA
  TIMERC2,       // PC 1 ** 9 ** SCL
#endif // defined(DIGITAL_IO_PIN_SHIFT) && defined(USE_TWIC)
  TIMERC2,       // PC 2 ** 10 **
  TIMERC2,       // PC 3 ** 11 **
  TIMERC2,       // PC 4 ** 12 ** SPI_SS
  TIMERC2,       // PC 5 ** 13 ** SPI_MOSI
  TIMERC2,       // PC 6 ** 14 ** SPI_MISO
  TIMERC2,       // PC 7 ** 15 ** SPI_SCK
  TIMERE0,       // PE 0 ** 16 ** SDA
  TIMERE0,       // PE 1 ** 17 ** SCL
  TIMERE0,       // PE 2 ** 18 **
  TIMERE0,       // PE 3 ** 19 **
  NOT_ON_TIMER,  // PR 0 ** 20 **
  NOT_ON_TIMER,  // PR 1 ** 21 ** default LED
#ifdef DIGITAL_IO_PIN_SHIFT
#ifdef USE_TWIC
  TIMERC2,       // PC 0 ** the new 20 ** SDA
  TIMERC2,       // PC 1 ** the new 21 ** SCL
#else
  TIMERD2,       // PD 0 ** the new 20 **
  TIMERD2,       // PD 1 ** the new 21 **
#endif // USE_TWIC
#endif // DIGITAL_IO_PIN_SHIFT
  NOT_ON_TIMER,  // PA 0 ** 22 ** A0
  NOT_ON_TIMER,  // PA 1 ** 23 ** A1
  NOT_ON_TIMER,  // PA 2 ** 24 ** A2
  NOT_ON_TIMER,  // PA 3 ** 25 ** A3
  NOT_ON_TIMER,  // PA 4 ** 26 ** A4
  NOT_ON_TIMER,  // PA 5 ** 27 ** A5
  NOT_ON_TIMER,  // PA 6 ** 28 ** A6
  NOT_ON_TIMER,  // PA 7 ** 29 ** A7
  NOT_ON_TIMER,  // PB 0 ** 30 ** A8
  NOT_ON_TIMER,  // PB 1 ** 31 ** A9
  NOT_ON_TIMER,  // PB 2 ** 32 ** A10
  NOT_ON_TIMER,  // PB 3 ** 33 ** A11
};

#endif


// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
//
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
//
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
//
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
//
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
//
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                            pins are NOT connected to anything by default.
#define SERIAL_PORT_MONITOR   Serial
#define SERIAL_PORT_HARDWARE  Serial
#define SERIAL_HARDWARE_OPEN  Serial2

#endif


